# UnableToCreateWallForPanel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallFailures..::..UnableToCreateWallForPanel Property
BuiltInFailures..::..WallFailures Class See Also
---
Unable to create wall for curtain wall panel.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToCreateWallForPanel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToCreateWallForPanel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToCreateWallForPanel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..WallFailures Class
Autodesk.Revit.DB Namespace